//#define _CRT_SECURE_NO_WARNINGS 1
//#include <stdio.h>
//
//int main()
//{
//    int n = 9;
//    //00000000000000000000000000001001 ->9的补码
//    float* pFloat = (float*)&n;
//    printf("n的值为：%d\n", n);
//    printf("*pFloat的值为：%f\n", *pFloat);
//    //0 00000000 000000000000000000001001
//    //     (-1)^0 * 000000000000000000001001 * 2^-126 ->0.00000
//    *pFloat = 9.0;
//    //0 10000010 001000000000000000000000 ->9.0的SME
//    printf("num的值为：%d\n", n);
//    //000000000000000000000000000001001 -> 1091567616
//    printf("*pFloat的值为：%f\n", *pFloat);
//    return 0;
//}