//#define _CRT_SECURE_NO_WARNINGS 1
//#include <stdio.h>
//
//int main() {
//		
//	char a = -1;
//	//-1截断后存储到a中;
//	//11111111;
//	signed char b = -1;
//	//当前编译器下signed char == char;
//	//11111111;
//	unsigned char c = -1;
//	//11111111;
//
//	//从赋值角度看是一样的：截断
//
//	printf("a = %d, b  = %d,c = %d", a, b, c);
//	//a = -1, b = -1, c = 255;
//	//a 、b、c都发生整型提升
//	// 有符号数
//	//11111111 ->11111111111111111111111111111111;
//	//					  11111111111111111111111111111110;
//	//					  10000000000000000000000000000001;				
//	// 无符号数
//	//11111111 ->00000000000000000000000011111111;
//	//				      
//}