//描述
//KiKi学习了循环，BoBo老师给他出了一系列打印图案的练习，该任务是打印用“* ”组成的箭形图案。
//输入描述：
//本题多组输入，每行一个整数（2~20）。
//输出描述：
//针对每行输入，输出用“ * ”组成的箭形。
//
//示例1
//输入：
//2
//复制
//输出：
//    *
//  **
//***
//  **
//    *
//复制
//示例2
//输入：
//3
//复制
//输出：
//      *
//    **
//  ***
//****
//  ***
//    **
//      *
//复制
//示例3
//输入：
//4
//复制
//输出：
//        *
//      **
//    ***
//  ****
//*****
//  ****
//    ***
//      **
//        *

#define _CRT_SECURE_NO_WARNINGS 1
//#include <stdio.h>
//int main() {
//    int n = 0;
//    while (scanf("%d", &n) != EOF) {
//        int i = 1;
//        for (i = 1; i <= n; i++) {
//            int j = 1;
//            for (; j <= 2 * (n - i + 1); j++) {
//                printf(" ");
//            }
//            int k = 1;
//            for (; k <= i; k++) {
//                printf("*");
//            }
//            printf("\n");
//        }
//        i = 1;
//        for (; i <= n + 1; i++) {
//            printf("*");
//        }
//        printf("\n");
//        for (i = n; i >= 1; i--) {
//            int j = 1;
//            for (; j <= 2 * (n - i + 1); j++) {
//                printf(" ");
//            }
//            int k = 1;
//            for (; k <= i; k++) {
//                printf("*");
//            }
//            printf("\n");
//        }
//    }
//    
//    
//}